function DeCideContents(s) {
  if (s == "kanji") {
    qcol = ['#3949ab', '#1a237e']
    acol = ['#ad1457', '#880e4f']
   ques_list=['綿と麻とのコンボウ', '大利益のチョウゾウ', '美しい音色がツムギだされる', '墓前に花をソナエル', 'タンセイな顔立ちの人', '先祖のクヨウを欠かさなう', 'わが身をカエリミル', '人事フセイに陥る', 'ガーゼを消毒液にヒタス', 'キンセイの取れた美しい建築', '軽率な言動を深くジセイする', '同じ過ちは犯すまいとジカイする', '俎上にノセル', '船に荷物をセキサイする', '詩の言葉にカンノウする', '実質がトモナワナイ', 'ピアノバンソウで歌う', 'すべての条件をグビしている', '雨水が地中にシンジュンする', 'みずからをイマシメル言葉', '剣道のしゅうれん', '能力ソウオウの仕事', 'ゲンカイ態勢を敷く', 'カイカ式の閲覧室', '着々とハントを広げる', '体面をケガス', '自体をシュウシュウする', '深いユウシュウに閉ざされる', '電線をカセツする', '顧客のニーズにコタエル', '人をベッシしてはいけない', 'エンジュクした演技', 'シュウジを用いた詩', '百選レンマの戦士', '写真をテンプする', 'ウレエルべき自体', '橋をカケル', '真っ赤にウレタ果物', 'マタタク間にスターになった', '人をグロウする態度', 'ケイベツの念を抱く', '式典に彩りをソエル', '起業のイメージアップをハカル', '出席をコンガンする', '激しいゾウオを燃やす', '数々のシンサンをなめる', '趣味がテイレツだ', '運命にホンロウされる', 'カタクナに口を閉ざす', 'コンセツ丁寧に解説する', 'いかにもセンパクな人間', '嘘つきとサゲスマレル', 'インニン自重を旨とする', '重要なポストをシメル', '学科の単位をシュウトクする', '人の気持ちをモテアソブ', '世間の動きにエイビンだ', 'ゼイシャクな構造', 'ハクボの湖畔', 'ねんごろにもてなす', '艱難シンクに耐える', '雑務にボウサツされる', '一点差にニクハクする', 'イヤシイ心', 'コウケツな人格', '共とユカイに語る', '戦いはセイサンを極めた', '情にモロイ', 'セイヒンに甘んじる', 'ジャケンに突き放す', 'ガンメイな父親', 'ヒキンな例']
   ans_list=['混紡', '彫像', '紡ぎ', '供える', '端整（端正）', '供養', '省みる', '不省', '浸す', '均整', '自省', '自戒', '載せる', '積載', '感応', '伴わない', '伴奏', '具備', '浸潤', '戒める', '習練', '相応', '厳戒', '開架', '版図', '汚す', '収拾', '憂愁', '架設', '応える', '蔑視', '円熟', '修辞', '練磨（錬磨）', '添付', '憂える', '架ける', '熟れた', '瞬く', '愚弄', '軽蔑', '添える', '図る', '懇願', '憎悪', '辛酸', '低劣', '翻弄', '頑な', '懇切', '浅薄', '蔑まれる', '隠忍', '占める', '修得', '弄ぶ', '鋭敏', '脆弱', '薄暮', '懇ろ', '辛苦', '忙殺', '肉薄（肉迫）', '卑しい', '高潔', '愉快', '凄惨', '脆い', '清貧', '邪険', '頑迷', '卑近']
  }
  else if(s=="kari"){
      qcol = ['#3949ab', '#1a237e']
      acol = ['#ad1457', '#880e4f']
      ques_list=['a','b','c','d']
      ans_list=['1','2','3','4']
  }
}
