
ques_list_dict = {
"kanji":['しょくばい', 'よじょうの物資', 'あびきょうかん', '相手をくっぷくさせる', 'がいはくな知識を持つ', '会社でのしょうがい係を担う', 'いぜんとした状態が続く', 'しゅういつな作品', 'さくいんで調べる', 'かんげい会', '試験にきゅうだいした', 'たくぜつした手腕', 'かんがいむりょう', '悪事をかんかできない', 'くったくのない顔つき', '大臣をこうてつする', 'ほうしゅう', 'てっていした品質管理', '宇宙からのきかん', '細かいことにこうでいしない', '実態をはあくする', 'ある科学者にけいとうする', '証拠品がいんとくされる', '華麗な演技にとうすいした', '議論がふんきゅうする', '買い物客がさっとうする', '時代さくごも甚だしい', '広くるふしている昔話', '純文学をようごする', '産業はいき物', 'いっかいの新人俳優', '彼は昔の私をそうきさせる', '両者がきんみつに相談する', 'ゆうずうのきく店', 'たいだな生活', '権威をそうしつする', 'ベテランでもまんしんは禁物だ', '紙をすうはいする', 'ほうふくぜっとう', '弟子をかんどうする', '過ぎ去った昔をついおくする', 'かんぜんと難局に当たる', '相手をいあつする', '会計のかんさ', '情報のちゅうしゅつ', '自由をきょうじゅする', '失礼の段ごようしゃください', '土砂がたいせきする', '信頼をかくとくする', '証人のかんもん', '条件にがいとうする', '前例にいきょする', 'たくえつした技術', 'モラル低下をがいたんする', '両方をかんあんして決める', 'きょうらく的な状態になる', '罪がしゃめんされる'],
}


ans_list_dict = {
"kanji":['触媒', '余剰', '阿鼻叫喚', '屈服', '該博', '渉外', '依然', '秀逸', '索引', '歓迎', '及第', '卓絶', '感慨無量', '看過', '屈託', '更迭', '報酬', '徹底', '帰還', '拘泥', '把握', '傾倒', '隠匿', '陶酔', '紛糾', '殺到', '錯誤', '流布', '擁護', '廃棄', '一介', '想起', '緊密', '融通', '怠惰', '喪失', '慢心', '崇拝', '抱腹絶倒', '勘当', '追憶', '敢然', '威圧', '監査', '抽出', '享受', '容赦', '堆積', '獲得', '喚問', '該当', '依拠', '卓越', '慨嘆', '勘案', '享楽', '赦免'],}
font_size_dict = {
  "kanji": "1.4rem",
}
selection_dict = {
  "kanji": "漢字",
}

