
ques_list_dict = {
"kanji":['カソ性のある樹脂', 'ジエイの策を練る', '悩みがウンサンムショウした', '悪霊をイッカツして追い払う', '喝采', '搬送', '歓談', '展覧', '先覚', '再燃', '発破', '人生をタッカンする', 'ごコウハイに感謝する', 'ベテラン監督がサイハイを振る', 'かんこんそうさい', '代々続くそほうか', 'オンショウを賜る', '状況をチクイチ報告する', 'ダボクした足が痛む', '研究論文のギギをただす', 'オクメンなくでしゃばる', '怠惰ゾウチョウさせる', '文例から意味をキノウする', 'ご壮健でシュウチャクに存じます', '流行にモウジュウしてはならない', '世界記録をホジする', '歴史にゾウケイが深い', '彼にはセンケンの明がある', 'キッチンデでスイジをする', '民族運動がボッコウする', '採算をドガイシする', '主任にショウシンした', 'シンシシュクジョ', 'ハクランキョウキでなる男', 'カイキュウの情にかられる', '強敵相手にケントウする', '試合でシュクンを立てた選手', '冷害によるキョウサク', '引用文のゲンテンに当たる', '悪のソウクツには近寄らない', '今なおメイミャクをためつ古典作品', '内閣のジンヨウを一新する', '会社の将来をソウケンに担う', '教育のガンモクは人間形成だ', 'あいつのテツメンピにはあきれる', '計画がアンショウに乗り上げる', '予めフクアンを練っておく', '他にヒケンする者のない達人', 'ジセツの到来を待つ', 'レイセツを重んじる', 'キミャクを通じている二人', '文化クンショウの授賞式', 'フクゾウなく話す', '母がシシュクしている先生', '氏神様にサンケイする', '船がザショウする', 'カツガンを開いて時代を見る', '相手の考えをオクソクする', '政界からホウチクされる', 'ハチクの勢いで勝ち進む', '騒音についてダンパンする', '小説などはサンブンだ', 'チマナコになって探す'],
}


ans_list_dict = {
"kanji":['可塑', '自衛', '雲散霧消', 'カッサイを博する', '学期を車ではんそうする', '友とカンダンする', 'テンラン会を開く', 'この研究のセンカクたる人物', '紛争のサイネンを防ぐ', '監督が選手にハッパをかける', '成功のキバクザイとなった企画', '達観', '高配', '采配', '冠婚葬祭', '素封家', '恩賞', '逐一', '打撲', '疑義', '臆面', '増長', '帰納', '祝着', '盲従', '保持', '造詣', '先見', '炊事', '勃興', '度外視', '昇進', '紳士淑女', '博覧強記', '懐旧', '健闘', '殊勲', '凶作', '原典', '巣窟', '命脈', '陣容', '双肩', '眼目', '鉄面皮', '暗礁', '腹案', '比肩', '時節', '礼節', '気脈', '勲章', '腹蔵', '私淑', '参詣', '座礁', '活眼', '憶測（臆測）', '放逐', '破竹', '談判', '散文', '血眼'],
}
font_size_dict = {
  "kanji": "1.4rem",
}
selection_dict = {
  "kanji": "漢字",
}